app/controllers/reservations_controller.rb

SELECT  "reservations".* FROM "reservations" WHERE (date_from =< '2018-09-28') AND (date_to => '2018-09-28') ORDER BY "reservations"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def get_reservation(date)
    Reservation.where("date_from <= ?", date).where("date_to >= ?", date).first